
**@flexwie suggests the following changes in this pull_request:**  

```terraform

Acquiring state lock. This may take a few moments...
hcloud_network.network: Refreshing state... [id=1253117]
hcloud_network_subnet.subnet: Refreshing state... [id=1253117-10.0.1.0/24]
hcloud_server.node1: Refreshing state... [id=15746566]
hcloud_server.db1: Refreshing state... [id=15746567]
hcloud_firewall.db_firewall: Refreshing state... [id=190878]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # hcloud_server.db1 has been deleted
  - resource "hcloud_server" "db1" {
      - backups            = false -> null
      - datacenter         = "nbg1-dc3" -> null
      - delete_protection  = false -> null
      - firewall_ids       = [] -> null
      - id                 = "15746567" -> null
      - image              = "ubuntu-20.04" -> null
      - ipv4_address       = "116.203.77.191" -> null
      - ipv6_address       = "2a01:4f8:c2c:d4d2::1" -> null
      - ipv6_network       = "2a01:4f8:c2c:d4d2::/64" -> null
      - keep_disk          = false -> null
      - labels             = {
          - "db" = "1"
        } -> null
      - location           = "nbg1" -> null
      - name               = "db1" -> null
      - rebuild_protection = false -> null
      - server_type        = "cx11" -> null
      - ssh_keys           = [
          - "3939407",
        ] -> null
      - status             = "running" -> null

      - network {
          - alias_ips   = [] -> null
          - ip          = "10.0.1.6" -> null
          - mac_address = "86:00:00:ee:85:2d" -> null
          - network_id  = 1253117 -> null
        }
    }
  # hcloud_server.node1 has been deleted
  - resource "hcloud_server" "node1" {
      - backups            = false -> null
      - datacenter         = "nbg1-dc3" -> null
      - delete_protection  = false -> null
      - firewall_ids       = [] -> null
      - id                 = "15746566" -> null
      - image              = "ubuntu-20.04" -> null
      - ipv4_address       = "23.88.60.182" -> null
      - ipv6_address       = "2a01:4f8:c0c:23e7::1" -> null
      - ipv6_network       = "2a01:4f8:c0c:23e7::/64" -> null
      - keep_disk          = false -> null
      - labels             = {
          - "node" = "1"
        } -> null
      - location           = "nbg1" -> null
      - name               = "node1" -> null
      - rebuild_protection = false -> null
      - server_type        = "cx11" -> null
      - ssh_keys           = [
          - "3939407",
        ] -> null
      - status             = "running" -> null

      - network {
          - alias_ips   = [] -> null
          - ip          = "10.0.1.5" -> null
          - mac_address = "86:00:00:ee:85:2e" -> null
          - network_id  = 1253117 -> null
        }
    }
  # hcloud_firewall.db_firewall has been changed
  ~ resource "hcloud_firewall" "db_firewall" {
        id     = "190878"
        name   = "db_firewall"
        # (1 unchanged attribute hidden)

      - apply_to {
          - server = 15746567 -> null
        }

        # (2 unchanged blocks hidden)
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # hcloud_firewall.db_firewall will be updated in-place
  ~ resource "hcloud_firewall" "db_firewall" {
        id     = "190878"
        name   = "db_firewall"
        # (1 unchanged attribute hidden)

      + apply_to {
          + label_selector = (known after apply)
          + server         = (known after apply)
        }

        # (2 unchanged blocks hidden)
    }

  # hcloud_server.db1 will be created
  + resource "hcloud_server" "db1" {
      + backup_window      = (known after apply)
      + backups            = false
      + datacenter         = (known after apply)
      + delete_protection  = false
      + firewall_ids       = (known after apply)
      + id                 = (known after apply)
      + image              = "ubuntu-20.04"
      + ipv4_address       = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_network       = (known after apply)
      + keep_disk          = false
      + labels             = {
          + "db" = "1"
        }
      + location           = "nbg1"
      + name               = "db1"
      + rebuild_protection = false
      + server_type        = "cx11"
      + ssh_keys           = [
          + "3939407",
        ]
      + status             = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.1.6"
          + mac_address = (known after apply)
          + network_id  = 1253117
        }
    }

  # hcloud_server.node1 will be created
  + resource "hcloud_server" "node1" {
      + backup_window      = (known after apply)
      + backups            = false
      + datacenter         = (known after apply)
      + delete_protection  = false
      + firewall_ids       = (known after apply)
      + id                 = (known after apply)
      + image              = "ubuntu-20.04"
      + ipv4_address       = (known after apply)
      + ipv6_address       = (known after apply)
      + ipv6_network       = (known after apply)
      + keep_disk          = false
      + labels             = {
          + "node" = "1"
        }
      + location           = "nbg1"
      + name               = "node1"
      + rebuild_protection = false
      + server_type        = "cx11"
      + ssh_keys           = [
          + "3939407",
        ]
      + status             = (known after apply)

      + network {
          + alias_ips   = []
          + ip          = "10.0.1.5"
          + mac_address = (known after apply)
          + network_id  = 1253117
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: iaac.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "iaac.tfplan"
Releasing state lock. This may take a few moments...

```

